src/Documents/РазрешениеНаЗаменуМатериалов/РазрешениеНаЗаменуМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаЗаменуМатериалов</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Catalog.РесурсныеСпецификации</basedOn>
  <registerRecords>InformationRegister.АналогиМатериалов</registerRecords>
  <attributes>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ЗаказНаПроизводство2_2</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаИзделия</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРазрешенийНаЗаменуМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>УказаниеПоПрименению</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВариантыИспользованияХарактеристикНоменклатуры/ВариантыИспользованияХарактеристикНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыИспользованияХарактеристикНоменклатуры</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеДляВидаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныеДляНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбщиеСДругимВидомНоменклатуры</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ЭтапыПроизводства/ЭтапыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПроизводства</name>
  <owners>Catalog.РесурсныеСпецификации</owners>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСледующегоЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОдновременноПроизводимоеКоличествоЕдиницПартийИзделий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьРаботуВидовРабочихЦентров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияДлительностиЭтапа</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительныйБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершающийБуфер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПредварительногоБуфера</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияЗавершающегоБуфера</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>CatalogRef.МаршрутныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрерывный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоНаСтороне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыПартнера</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоЕдиницПартийИзделия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗанимаемаяМощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентМаршрутнойКарты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРаботыВидовРабочихЦентров</name>
    <type>
      <types>EnumRef.ПорядокРаботыВидовРабочихЦентров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПараметризацияРесурсов</name>
    <comment>Служебный реквизит, кэширует значения реквизитов табличной части</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьУслугаПереработчика</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХарактеристикаУслугиПереработчика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидыРабочихЦентровСФормуламиОбновлены</name>
    <comment>Служебный реквизит, необходимый для обработчика обновления</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОдновременноПроизводимоеКоличествоЕдиницПартийИзделий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыРабочихЦентров</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантНаладки</name>
      <type>
        <types>CatalogRef.ВариантыНаладки</types>
      </type>
    </attributes>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаКоличества</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы</name>
      <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АльтернативныеВидыРабочихЦентров</name>
    <attributes>
      <name>ВидРабочегоЦентра</name>
      <type>
        <types>CatalogRef.ВидыРабочихЦентров</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантНаладки</name>
      <type>
        <types>CatalogRef.ВариантыНаладки</types>
      </type>
    </attributes>
    <attributes>
      <name>Загрузка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиВидыРабочихЦентров</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаКоличества</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмРасчетаКоличестваИсторияПереходаНаНовыеФормулы</name>
      <comment>Значение формулы до перехода на новый формат либо первое значение формулы введенное после перехода</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтборПоСвойствам</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УслугиПереработчика</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/РазрешениеНаЗаменуМатериалов/Forms/ФормаВводаОбластиДействия/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СписокСвойств = "НаправлениеДеятельности,"
					+ "ЗаказНаПроизводство,"
					+ "ЗаказКлиента,"
					+ "Подразделение,"
					+ "Спецификация,"
					+ "Этап,"
					+ "Изделие,"
					+ "ХарактеристикаИзделия,"
					+ "КоличествоМатериалов";
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокСвойств);
	
	ИспользоватьНаправлениеДеятельности = ЗначениеЗаполнено(НаправлениеДеятельности);
	ИспользоватьЗаказНаПроизводство = ЗначениеЗаполнено(ЗаказНаПроизводство);
	ИспользоватьЗаказКлиента = ЗначениеЗаполнено(ЗаказКлиента);
	ИспользоватьПодразделение = ЗначениеЗаполнено(Подразделение);
	
	//++ Устарело_Производство21
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2") Тогда
	//-- Устарело_Производство21	
		Если ЗначениеЗаполнено(ЗаказКлиента) 
			ИЛИ ЗначениеЗаполнено(ЗаказНаПроизводство) 
				И ТипЗнч(ЗаказНаПроизводство) <> Тип("ДокументСсылка.ЗаказНаПроизводство2_2")Тогда
			ТолькоПросмотр = Истина;
			Элементы.ФормаОК.Доступность = Ложь;
		Иначе
			Элементы.ЗаказНаПроизводство.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство2_2");
			Элементы.ИспользоватьЗаказКлиента.Видимость = Ложь;
			Элементы.ЗаказКлиента.Видимость = Ложь;
		КонецЕсли;
	//++ Устарело_Производство21
	Иначе
		Элементы.ЗаказНаПроизводство.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство");
	КонецЕсли;
	//-- Устарело_Производство21
	
	Если ЗначениеЗаполнено(Спецификация) Тогда
		
		ИспользоватьИзделие = Истина;
		РежимИспользованиеИзделие = 1;
		ПоСпецификации = Истина;
		ИспользоватьЭтап = ЗначениеЗаполнено(Этап);
		
	ИначеЕсли ЗначениеЗаполнено(Изделие) Тогда
		
		ИспользоватьИзделие = Истина;
		РежимИспользованиеИзделие = 0;
		
		Если ЗначениеЗаполнено(ХарактеристикаИзделия) Тогда
			ИспользуютсяХарактеристикиДляТекущегоИзделия = Истина;
			ИспользоватьХарактеристикуИзделия = Истина;
		Иначе
			ИспользуютсяХарактеристикиДляТекущегоИзделия = ПризнакИспользованияХарактеристикНаСервере(Изделие);
			ИспользоватьХарактеристикуИзделия = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Спецификация) ИЛИ КоличествоМатериалов > 0 Тогда
		УведомлятьОбИзмененииРежима = Истина;
	КонецЕсли;
	
	УстановитьДоступность();

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ТекстВопроса = НСтр("ru = 'Данные были изменены. Перенести изменения в документ?';
						|en = 'The data was modified. Migrate the changes to the document?'");
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьНаКлиенте", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы, ТекстВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьНаправлениеДеятельностиПриИзменении(Элемент)
	Элементы.НаправлениеДеятельности.Доступность = ИспользоватьНаправлениеДеятельности;	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказНаПроизводствоПриИзменении(Элемент)
	Элементы.ЗаказНаПроизводство.Доступность = ИспользоватьЗаказНаПроизводство;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаказКлиентаПриИзменении(Элемент)
	Элементы.ЗаказКлиента.Доступность = ИспользоватьЗаказКлиента;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПодразделениеПриИзменении(Элемент)
	Элементы.Подразделение.Доступность = ИспользоватьПодразделение;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьИзделиеПриИзменении(Элемент)
	
	ИспользоватьХарактеристикуИзделия = Ложь;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользоватьХарактеристикуИзделия,
		ИспользуютсяХарактеристикиДляТекущегоИзделия, 
		ИспользоватьЭтап);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСпецификацииПриИзменении(Элемент)
	
	Если УведомлятьОбИзмененииРежима Тогда
		
		ТекстВопроса = Нстр("ru = 'Изменение области действия приведет к очистке 
									|табличной части ""Набор заменяемых материалов"".
									|Продолжить?';
									|en = 'Changing the scope will clear 
									| the ""Set of substitutes"" table.
									| Continue?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПоСпецификацииПриИзмененииЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	ПоСпецификацииПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСпецификацииПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        УведомлятьОбИзмененииРежима = Ложь;
		ПоСпецификацииПриИзмененииФрагмент();
	Иначе
		РежимИспользованиеИзделие = 0;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПоСпецификацииПриИзмененииФрагмент()
	
    ИспользоватьХарактеристикуИзделия = Ложь;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользоватьХарактеристикуИзделия,
		ИспользуютсяХарактеристикиДляТекущегоИзделия, 
		ИспользоватьЭтап);

КонецПроцедуры

&НаКлиенте
Процедура СпецификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если УведомлятьОбИзмененииРежима Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстВопроса = Нстр("ru = 'Изменение спецификации приведет к очистке табличной части ""Материалы"", продолжить?';
							|en = 'Changing the BOM will clear the ""Materials"" table. Continue?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("СпецификацияНачалоВыбораЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоПроизводимомуИзделиюПриИзменении(Элемент)
	
	ИспользоватьХарактеристикуИзделия = Ложь;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользоватьХарактеристикуИзделия,
		ИспользуютсяХарактеристикиДляТекущегоИзделия, 
		ИспользоватьЭтап);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзделиеПриИзменении(Элемент)
	
	ИспользоватьХарактеристикуИзделия = Ложь;
	
	Если ЗначениеЗаполнено(Изделие) Тогда
		ИспользуютсяХарактеристикиДляТекущегоИзделия = ПризнакИспользованияХарактеристикНаСервере(Изделие);
	Иначе
		ИспользуютсяХарактеристикиДляТекущегоИзделия = Ложь;
	КонецЕсли;
	
	Элементы.ИспользоватьХарактеристикуИзделия.Доступность = ИспользуютсяХарактеристикиДляТекущегоИзделия;
	Элементы.ХарактеристикаИзделия.Доступность = ИспользоватьХарактеристикуИзделия;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьХарактеристикуИзделияПриИзменении(Элемент)
	Элементы.ХарактеристикаИзделия.Доступность = ИспользоватьХарактеристикуИзделия;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЭтапПриИзменении(Элемент)
	Элементы.Этап.Доступность = ИспользоватьЭтап;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Модифицированность Тогда
		ЗавершитьРедактирование();
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция РезультатРедактированияНаСервере()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НаправлениеДеятельности", ?(ЗначениеЗаполнено(НаправлениеДеятельности) И ИспользоватьНаправлениеДеятельности,
		НаправлениеДеятельности, Справочники.НаправленияДеятельности.ПустаяСсылка()));
		
	Результат.Вставить("ЗаказНаПроизводство", ?(ЗначениеЗаполнено(ЗаказНаПроизводство) И ИспользоватьЗаказНаПроизводство,
		ЗаказНаПроизводство, Неопределено));
		
	Результат.Вставить("ЗаказКлиента", ?(ЗначениеЗаполнено(ЗаказКлиента) И ИспользоватьЗаказКлиента,
		ЗаказКлиента, Документы.ЗаказКлиента.ПустаяСсылка()));
		
	Результат.Вставить("Подразделение", ?(ЗначениеЗаполнено(Подразделение) И ИспользоватьПодразделение,
		Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка()));
		
	Результат.Вставить("Спецификация", ?(ЗначениеЗаполнено(Спецификация) И ИспользоватьИзделие И РежимИспользованиеИзделие = 1,
		Спецификация, Справочники.РесурсныеСпецификации.ПустаяСсылка()));
		
	Результат.Вставить("Этап", ?(ЗначениеЗаполнено(Этап) И ИспользоватьЭтап,
		Этап, Справочники.ЭтапыПроизводства.ПустаяСсылка()));
		
	Результат.Вставить("Изделие", ?(ЗначениеЗаполнено(Изделие) И ИспользоватьИзделие И РежимИспользованиеИзделие = 0,
		Изделие, Справочники.Номенклатура.ПустаяСсылка()));
		
	Результат.Вставить("ХарактеристикаИзделия", ?(ЗначениеЗаполнено(ХарактеристикаИзделия) И ИспользоватьХарактеристикуИзделия,
		ХарактеристикаИзделия, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()));
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьРедактирование()
	
	Отказ = Ложь;
	
	// Проверка заполнения
	ОчиститьСообщения();
	
	Если ИспользоватьНаправлениеДеятельности И Не ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		ТекстОшибки = Нстр("ru = 'Поле ""Направление деятельности"" не заполнено';
							|en = '""Line of business"" is required'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "НаправлениеДеятельности", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьЗаказНаПроизводство И Не ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
		ТекстОшибки = Нстр("ru = 'Поле ""Заказ на производство"" не заполнено';
							|en = '""Production order"" is required'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ЗаказНаПроизводство", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьЗаказКлиента И Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ТекстОшибки = Нстр("ru = 'Поле ""Заказ клиента"" не заполнено';
							|en = '""Sales order"" is required'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ЗаказКлиента", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьПодразделение И Не ЗначениеЗаполнено(Подразделение) Тогда
		ТекстОшибки = Нстр("ru = 'Поле ""Подразделение"" не заполнено';
							|en = '""Business unit"" is required'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Подразделение", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьИзделие И РежимИспользованиеИзделие = 1 И Не ЗначениеЗаполнено(Спецификация) Тогда	
		ТекстОшибки = Нстр("ru = 'Поле ""Спецификация"" не заполнено';
							|en = '""Bill of materials"" is required'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Спецификация", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьЭтап И Не ЗначениеЗаполнено(Этап) Тогда
		ТекстОшибки = Нстр("ru = 'Поле ""Этап"" не заполнено';
							|en = '""Stage"" is required'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Этап", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьИзделие И РежимИспользованиеИзделие = 0 И Не ЗначениеЗаполнено(Изделие) Тогда
		ТекстОшибки = Нстр("ru = 'Поле ""Номенклатура"" не заполнено';
							|en = '""Product"" is not filled in'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Изделие", , Отказ);
	КонецЕсли;
	
	Если ИспользоватьХарактеристикуИзделия И Не ЗначениеЗаполнено(ХарактеристикаИзделия) Тогда
		ТекстОшибки = Нстр("ru = 'Поле ""Характеристика"" не заполнено';
							|en = '""Variant"" is not filled in'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ХарактеристикаИзделия", , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	СтруктураВыбора = Новый Структура();
	СтруктураВыбора.Вставить("ВыполняемаяОперация", "ВыборОбластиДействия");
	СтруктураВыбора.Вставить("ЗначениеВыбора", РезультатРедактированияНаСервере());
	
	ОповеститьОВыборе(СтруктураВыбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	
	Элементы.НаправлениеДеятельности.Доступность = ИспользоватьНаправлениеДеятельности;
	Элементы.ЗаказНаПроизводство.Доступность = ИспользоватьЗаказНаПроизводство;
	Элементы.ЗаказКлиента.Доступность = ИспользоватьЗаказКлиента;
	Элементы.Подразделение.Доступность = ИспользоватьПодразделение;
	
	УстановитьДоступностьИзделие(
		Элементы, 
		ИспользоватьИзделие, 
		РежимИспользованиеИзделие, 
		ИспользоватьХарактеристикуИзделия,
		ИспользуютсяХарактеристикиДляТекущегоИзделия, 
		ИспользоватьЭтап);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИзделие(
			Элементы,
			ПризнакДоступности,
			РежимДоступности,
			ПризнакДоступностиХарактеристики,
			ИспользованиеХарактеристики,
			ИспользоватьЭтап)
	
	ДоступностьСпецификация = ПризнакДоступности И (РежимДоступности = 1);
	ДоступностьИзделие = ПризнакДоступности И (РежимДоступности = 0);   
	
	Элементы.ПоСпецификации.Доступность = ПризнакДоступности;	
	Элементы.ПоПроизводимомуИзделию.Доступность = ПризнакДоступности;	
	
	Элементы.Спецификация.Доступность = ДоступностьСпецификация;
	Элементы.СпецификацияНадпись.Доступность = ДоступностьСпецификация;
	
	Элементы.ИспользоватьЭтап.Доступность = ДоступностьСпецификация;
	Элементы.Этап.Доступность = ДоступностьСпецификация И ИспользоватьЭтап;
	
	Элементы.Изделие.Доступность = ДоступностьИзделие;
	Элементы.ИзделиеНадпись.Доступность = ДоступностьИзделие;
	
	Элементы.ИспользоватьХарактеристикуИзделия.Доступность = ДоступностьИзделие И ИспользованиеХарактеристики;
	Элементы.ХарактеристикаИзделия.Доступность = ПризнакДоступностиХарактеристики И ИспользованиеХарактеристики;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПризнакИспользованияХарактеристикНаСервере(Номенклатура)
	
	ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ИспользованиеХарактеристик");
	
	Если ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры 
		Или ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры
		Или ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры
		Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьНаКлиенте(Результат, ДополнительныеПараметры) Экспорт 
	
	ЗавершитьРедактирование();
	
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УведомлятьОбИзмененииРежима = Ложь;
		ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаВыбора",, Элементы.Спецификация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
